<?php
class botMessage
{
    public function get($q, $extra = Null)
    {
        global $bot;
        switch ($q) {
            case 1:
                return [
                    "keyboard" => $bot->keyboard([
                            ["🌱سنجد های من", "🛍تبدیل سنجد به..."],
                            ["❓چجوری سنجد جمع کنم❓"],
                        ]
                    ),
                    "text" => "به سِنجد خوش اومدی! 🎉🎊\n\nبرای استفاده از سیستم «سِنجد» و تخفیف‌های اون روی دکمه های زیر کلیک کن 👍🏻\n\nکلی شارژ و تخفیف و هدیه منتظرته 🎁"
                ];
                break;
            case 2:
                return [
                    "keyboard" => $bot->inline_keyboard([
                            [
                                ["text" => "در کانال ها عضو شدم", "callback_data" => "check:joinch"],
                            ],
                        ]
                    ),
                    "text" => $extra . " جان عزیز\n\nشما به سنجد دعوت شدی🌱\n\nاینجا میتونی کلی سنجد جمع کنی و اونارو به 📱شارژ، 🚘سفر، 🍕کد تخفیف رستوران و کلی تخفیف جذاب دیگه تبدیل کنی🎉🎊\n\nتیم سنجد برای اینکه بتونه از پس هزینه های سنگینش در بیاد نیاز به حمایت شما عزیزان داره❤️\nاگه میخوای ادامه بدی توی کانال سنجد و پرشین عضو شو و روی دکمه «در کانال ها عضو شدم» کلیک کن\n\nکلی اتفاق‌های هیجان انگیز منتظرته☺️\n\nآیدی کانال ها:\n\n🌿 @SubCreator\n\n🅱️ @SubCreator"
                ];
                break;
            case 3:
                return [
                    "keyboard" => $bot->keyboard([
                            ["⏳ عضویت در کانال سنجد (5 سنجد)"],
                            ["✅ دعوت کاربران به ربات (3 سنجد)"],
                            ["برگشت🔙"],
                        ]
                    ),
                    "text" => "برای جمع کردن سنجد میتونی از دکمه های زیر استفاده کنی"
                ];
                break;
            case 4:
                $points = $bot->getPoints();
                return [
                    "text" => "شما " . $points[1] . " سنجد تایید شده \nو " . $points[0] . " سنجد تایید نشده دارید\n\n✅ سنجدهای تایید شده: مربوط به کابرانی هستند که با لینک شما وارد شده‌اند و حساب کاربری خودشون رو تایید کردند\n\n⚠️ سنجدهای تایید نشده: مربوط به آن دسته از زیر مجموعه‌های شما هستند که هنوز حساب کاربری خودشان را تایید نکرده اند."
                ];
                break;
            case 5:
                return [
                    "keyboard" => $bot->keyboard([
                            ["⏳ تبدیل سنجد به شارژ"],
                            ["⏳ تبدیل سنجد به کدتخفیف"],
                            ["⏳ تبدیل سنجد به پول نقد"],
                            ["برگشت🔙"],
                        ]
                    ),
                    "text" => "اگه میخوای سنجداتو تبدیل به شارژ یا کدتخفیف کنی روی دکمه مورد نظر کلیک کن"
                ];
                break;
            case 6:
                return [
                    "keyboard" => $this->get($extra)["keyboard"],
                    "text" => "قبلا تو کانالمون عضو شدی و سنجدتو گرفتی🌿"
                ];
                break;
            case 7:
                return [
                    "keyboard" => $this->get($extra)["keyboard"],
                    "text" => "عضویت شما با موفقیت در کانال ما تایید شد و 5 امتیاز دریافت کردید✅"
                ];
                break;
            case 8:
                return [
                    "keyboard" => $bot->keyboard([
                            ["📲ایرانسل", "📲همراه اول", "📲رایتل"],
                            ["برگشت🔙", "منو اصلی⏪"],
                        ]
                    ),
                    "text" => "لطفا اپراتور خود را انتخاب نمایید 👇"
                ];
                break;
            case 9:
                return [
                    "keyboard" => $bot->keyboard([
                            ["💼 کارت تخفیف دیجیکالا"],
                            ["🍕 کارت تخفیف اسنپ فود", "🚕 کارت تخفیف اسنپ"],
                            ["برگشت🔙", "منو اصلی⏪"],
                        ]
                    ),
                    "text" => "لطفا یکی از گزینه های زیر را انتخاب نمایید 👇"
                ];
                break;
            case 10:
                return [
                    "keyboard" => $bot->keyboard([
                            ["100 هزار تومان (1400 سنجد)"],
                            ["200 هزار تومان (2700 سنجد)"],
                            ["500 هزار تومان (6700 سنجد)"],
                            ["برگشت🔙", "منو اصلی⏪"],
                        ]
                    ),
                    "text" => "لطفا یکی از گزینه های زیر را انتخاب نمایید 👇"
                ];
                break;
            case 11:
                return [
                    "text" => "در حال آماده سازی بنر شما..."
                ];
                break;
            case 12:
                return [
                    "keyboard" => $this->get(3)["keyboard"],
                    "text" => "(متن رو خودتون تکمیل کنید)\n----------------------\nلینک شما:\nhttps://t.me/" . $bot->username . "?start=" . $extra
                ];
                break;
            case 13:
                $extra = $this->get($extra);
                return [
                    "keyboard" => $extra["keyboard"],
                    "text" => "خطا: لینک زیر مجموعه گیری نامعتبر است...\n➖➖➖➖➖➖➖➖➖➖\n" . $extra["text"]
                ];
                break;
            case 14:
                $extra = $this->get($extra);
                return [
                    "keyboard" => $extra["keyboard"],
                    "text" => "خطا: شما نمیتوانید روی لینک خودتان کلیک کنید...\n➖➖➖➖➖➖➖➖➖➖\n" . $extra["text"]
                ];
                break;
            case 15:
                $extra = $this->get($extra);
                return [
                    "keyboard" => $extra["keyboard"],
                    "text" => "خطا: شما از قبل در این ربات عضو بوده اید و دیگر نمیتوانید با استفاده از لینک های زیر مجموعه گیری وارد ربات شوید...\n➖➖➖➖➖➖➖➖➖➖\n" . $extra["text"]
                ];
                break;
            case 16:
                return [
                    "keyboard" => $bot->keyboard(
                        [
                            [
                                ['text' => 'ارسال شماره📱', 'request_contact' => true],
                            ],
                        ]
                    ),
                    "text" => "به سِنجد خوش اومدی! 🎉🎊\n\nاینجا میتونی کلی سنجد جمع کنی و اونارو به 📱شارژ، 🚘سفر، 🍕کد تخفیف رستوران و کلی تخفیف جذاب دیگه تبدیل کنی🎉🎊\n➖➖➖➖➖➖➖➖\nفقط یک مرحله دیگه مونده تا تو هم سنجدی شی😃\nروی دکمه زیر کلیک کن و شماره موبایلت رو با ما به اشتراک بگذار؛\nبرای این کار روی دکمه مربع ‌شکل 🎛 پایین کلیک و بعد گزینه «ارسال شماره📱»  رو انتخاب کن تا دکمه های ربات برای تو نمایش داده بشه. 👍🏻"
                ];
                break;
            case 17:
                return [
                    "keyboard" => $this->get(16)["keyboard"],
                    "text" => "شماره شما مربوط به ایران نیست و نمیتوانید به این ربات دسترسی داشته باشید..."
                ];
                break;
            case 18:
                return [
                    "keyboard" => $this->get(16)["keyboard"],
                    "text" => "خطایی رخ داده است⚠️\nاین شماره مربوط به حساب کاربری شما نیست!\nلطفا با از استفاده از دکمه زیر شمارتون را ارسال کنید:"
                ];
                break;
            case 19:
                return [
                    "keyboard" => $this->get(16)["keyboard"],
                    "text" => "فقط یک مرحله دیگه مونده تا تو هم سنجدی شی😃\nروی دکمه زیر کلیک کن و شماره موبایلت رو با ما به اشتراک بگذار؛\nبرای این کار روی دکمه مربع ‌شکل 🎛 پایین کلیک و بعد گزینه «ارسال شماره📱»  رو انتخاب کن تا دکمه های ربات برای تو نمایش داده بشه. 👍🏻"
                ];
                break;
            case 20:
                $extra = $this->get(1);
                return [
                    "keyboard" => $extra["keyboard"],
                    "text" => "اکانت شما با موفقیت تایید شد✅\n➖➖➖➖➖➖➖➖➖➖\n" . $extra["text"]
                ];
                break;
            case 21:
                return [
                    "keyboard" => $bot->keyboard([
                            ["آمار ربات", "افزودن اعتبار"],
                            ["برگشت🔙"],
                        ]
                    ),
                    "text" => "به پنل مدیریتی ربات خوشامدید..."
                ];
                break;
            case 22:
                $extra = empty($extra) ? Null : "اعتبار با موفقیت افزوده شد✅\n";
                return [
                    "keyboard" => $bot->keyboard([
                            ["افزودن اعتبار شارژ"],
                            ["افزودن کد تخفیف"],
                            ["برگشت🔙"],
                        ]
                    ),
                    "text" => empty($extra) ? "برای افزودن اعتبار روی گزینه های زیر کلیک کنید:" : "اعتبار با موفقیت افزوده شد✅\nبرای افزودن اعتبار 'جدید' روی گزینه های زیر کلیک کنید:"
                ];
                break;
            case 23:
                return [
                    "keyboard" => $bot->keyboard([
                            ["برگشت🔙"],
                        ]
                    ),
                    "text" => "لطفا کد شارژ را وارد کنید:"
                ];
                break;
            case 24:
                return [
                    "keyboard" => $this->get(23)["keyboard"],
                    "text" => "ورودی نامعتبر⚠️\nمقدار وارد شده باید کمتر از 255 حرف باشد."
                ];
                break;
            case 25:
                return [
                    "keyboard" => $bot->keyboard([
                            ["ایرانسل - شارژ 2,000 تومانی"],
                            ["ایرانسل - شارژ 5,000 تومانی"],
                            ["ایرانسل - شارژ 20,000 تومانی"],
                            ["رایتل - شارژ 2,000 تومانی"],
                            ["رایتل - شارژ 5,000 تومانی"],
                            ["رایتل - شارژ 20,000 تومانی"],
                            ["همراه اول - شارژ 2,000 تومانی"],
                            ["همراه اول - شارژ 5,000 تومانی"],
                            ["همراه اول - شارژ 20,000 تومانی"],
                            ["برگشت🔙"],
                        ]
                    ),
                    "text" => "لطفا نوع کارت شارژ را انتخاب کنید:"
                ];
                break;
            case 26:
                return [
                    "keyboard" => $bot->keyboard([
                            ["برگشت🔙"],
                        ]
                    ),
                    "text" => "لطفا کد تخفیف را وارد کنید:"
                ];
                break;
            case 27:
                return [
                    "keyboard" => $bot->keyboard([
                            ["اسنپ - تخفیف 5,000 تومانی"],
                            ["اسنپ - تخفیف 10,000 تومانی"],
                            ["اسنپ - تخفیف 20,000 تومانی"],
                            ["اسنپ فود - تخفیف 5,000 تومانی"],
                            ["اسنپ فود - تخفیف 10,000 تومانی"],
                            ["اسنپ فود - تخفیف 20,000 تومانی"],
                            ["دیجیکالا - تخفیف 50,000 تومانی"],
                            ["دیجیکالا - تخفیف 100,000 تومانی"],
                            ["برگشت🔙"],
                        ]
                    ),
                    "text" => "لطفا نوع کارت شارژ را انتخاب کنید:"
                ];
                break;
            case 28:
                return [
                    "keyboard" => $bot->keyboard([
                            ["شارژ 2,000 تومانی (30 سنجد)"],
                            ["شارژ 5,000 تومانی (75 سنجد)"],
                            ["شارژ 20,000 تومانی (290 سنجد)"],
                            ["برگشت🔙"],
                        ]
                    ),
                    "text" => "لطفا مبلغ شارژ را انتخاب نمایید 👇"
                ];
                break;
            case 29:
                return [
                    "keyboard" => $this->get(8)["keyboard"],
                    "text" => "کارت شارژ شما با موفقیت ایجاد شد✅\nکد شارژ: " . $extra
                ];
                break;
            case 30:
                return [
                    "keyboard" => $bot->keyboard([
                            ["کارت تخفیف 50,000 تومانی دیجیکالا (680 سنجد)"],
                            ["کارت تخفیف 100,000 تومانی دیجیکالا (1220 سنجد)"],
                            ["برگشت🔙"],
                        ]
                    ),
                    "text" => "لطفا مبلغ تخفیف مورد نظرتان را انتخاب نمایید 👇"
                ];
                break;
            case 31:
                if (empty($extra))
                    return [
                        "keyboard" => $bot->keyboard([
                                ["تخفیف 5,000 تومانی اسنپ (70 سنجد)"],
                                ["تخفیف 10,000 تومانی اسنپ (140 سنجد)"],
                                ["تخفیف 20,000 تومانی اسنپ (270 سنجد)"],
                                ["برگشت🔙"],
                            ]
                        ),
                        "text" => $this->get(30)["text"]
                    ];
                else
                    return [
                        "keyboard" => $bot->keyboard([
                                ["تخفیف 5,000 تومانی اسنپ فود (70 سنجد)"],
                                ["تخفیف 10,000 تومانی اسنپ فود (140 سنجد)"],
                                ["تخفیف 20,000 تومانی اسنپ فود (270 سنجد)"],
                                ["برگشت🔙"],
                            ]
                        ),
                        "text" => $this->get(30)["text"]
                    ];
                break;
            case 32:
                return [
                    "keyboard" => $this->get(9)["keyboard"],
                    "text" => "کارت تخفیف 50000 تومانی دیجیکالا شما با موفقیت آماده شد✅\nکد تخفیف: " . $extra
                ];
                break;
            case 33:
                return [
                    "keyboard" => $this->get(9)["keyboard"],
                    "text" => "کارت تخفیف 100000 تومانی دیجیکالا شما با موفقیت آماده شد✅\nکد تخفیف: " . $extra
                ];
                break;
            case 34:
                return [
                    "keyboard" => $this->get(9)["keyboard"],
                    "text" => "کارت تخفیف " . $extra[0] . " تومانی شما با موفقیت آماده شد✅\nکد تخفیف: " . $extra[1]
                ];
                break;
            case 35:
                return [
                    "text" => "آمار ربات:\n➖➖➖➖➖➖➖➖➖\n"
                        . "تعداد کاربران ربات: " . number_format($extra['Users']) . "\n"
                        . "تعداد شماره های ذخیره شده: [" . $extra['Number'] . "]\n\n"
                        . "تعداد شارژ ایرانسل - 2000ت: [" . $extra['irancell_1'] . "]\n"
                        . "تعداد شارژ ایرانسل - 5000ت: [" . $extra['irancell_2'] . "]\n"
                        . "تعداد شارژ ایرانسل - 20000ت: [" . $extra['irancell_3'] . "]\n\n"
                        . "تعداد شارژ همراه اول - 2000ت: [" . $extra['mci_1'] . "]\n"
                        . "تعداد شارژ همراه اول - 5000ت: [" . $extra['mci_2'] . "]\n"
                        . "تعداد شارژ همراه اول - 20000ت: [" . $extra['mci_3'] . "]\n\n"
                        . "تعداد شارژ رایتل - 2000ت: [" . $extra['rightel_1'] . "]\n"
                        . "تعداد شارژ رایتل - 5000ت: [" . $extra['rightel_2'] . "]\n"
                        . "تعداد شارژ رایتل - 20000ت: [" . $extra['rightel_3'] . "]\n\n"
                        . "تعداد کارت تخفیف دیجیکالا - 50000ت: [" . $extra['digikala_1'] . "]\n"
                        . "تعداد کارت تخفیف دیجیکالا - 100000ت: [" . $extra['digikala_2'] . "]\n\n"
                        . "تعداد کارت تخفیف اسنپ - 5000ت: [" . $extra['snapp_1'] . "]\n"
                        . "تعداد کارت تخفیف اسنپ - 10000ت: [" . $extra['snapp_2'] . "]\n"
                        . "تعداد کارت تخفیف اسنپ - 20000ت: [" . $extra['snapp_3'] . "]\n\n"
                        . "تعداد کارت تخفیف اسنپ فود - 5000ت: [" . $extra['snappfood_1'] . "]\n"
                        . "تعداد کارت تخفیف اسنپ فود - 10000ت: [" . $extra['snappfood_2'] . "]\n"
                        . "تعداد کارت تخفیف اسنپ فود - 20000ت: [" . $extra['snappfood_3'] . "]\n"
                ];
                break;
            case 36:
                return [
                    "keyboard" => $bot->keyboard([
                            ["برگشت🔙"],
                        ]
                    ),
                    "text" => "لطفا شماره کارت و نام صاحب کارت را ارسال کنید:"
                ];
                break;
            case 37:
                return [
                    "keyboard" => $this->get(10)["keyboard"],
                    "text" => "درخواست شما با موفقیت ارسال شد و بزودی مبلغ مورد نظر به حساب شما واریز میگردد✅"
                ];
                break;
            case 38:
                return [
                    "keyboard" => $bot->inline_keyboard([
                            [
                                ["text" => "واریز انجام شد✅", "callback_data" => "payed:" . $bot->user_id],
                            ],
                        ]
                    ),
                    "text" => "درخواست پول جدید ارسال شد!\nمبلغ : " . $extra[1] . "\nتوضیحات و شماره کارت کاربر:\n\n" . $extra[0]
                ];
                break;
            case 39:
                return [
                    "text" => "تسویه حساب درخواستی شما با موفقیت انجام شد و مبلغ مورد نظر به حساب شما واریز شد."
                ];
                break;
            case 40:
                return [
                    "text" => "اطلاع رسانی به کاربر ارسال گردید✅"
                ];
                break;
            case 404:
                return [
                    "keyboard" => $this->get($extra)["keyboard"],
                    "text" => "دستور وارد شده اشتباه است⚠️"
                ];
                break;
            case 422:
                return [
                    "keyboard" => $this->get($extra)["keyboard"],
                    "text" => "مرحله غیر قابل پردازش شناسایی و حذف شد⚠️\nمرحله:" . $extra
                ];
                break;
            case -1:
                return [
                    "keyboard" => $this->get(8)["keyboard"],
                    "text" => "❗️درحال حاضر در ربات این شارژ وجود ندارد.\nلطفا بعدا مراجعه کنید و یا اپراتور جدید خود را انتخاب نمایید 👇..."
                ];
                break;
            case -2:
                $extra[1] = $extra[1] - $extra[0];
                return [
                    "keyboard" => $this->get(28)["keyboard"],
                    "text" => "️به میزان کافی سنجد نداری!\nشما " . $extra[0] . " سنجد دارید و به " . $extra[1] . " سنجد دیگر نیاز دارید..."
                ];
                break;
            case -3:
                return [
                    "keyboard" => $this->get(31)["keyboard"],
                    "text" => $this->get(-2, $extra)["text"]
                ];
                break;
            case -4:
                return [
                    "keyboard" => $this->get(9)["keyboard"],
                    "text" => "❗️درحال حاضر در ربات این تخفیف وجود ندارد.\nلطفا بعدا مراجعه کنید و یا گزینه ای جدید را انتخاب نمایید 👇..."
                ];
                break;
            case -5:
                return [
                    "keyboard" => $this->get(10)["keyboard"],
                    "text" => $this->get(-2, $extra)["text"]
                ];
                break;
            default:
                return "Error 404T";
                break;
        }
    }
}
