<?php
class botMessage
{
    public function get($q, $extra = Null)
    {
        global $bot;
        switch ($q) {
            case 1:
                return [
                    "keyboard" => $bot->keyboard([
                            ["🌱سنجد های من", "🛍تبدیل سنجد به..."],
                            ["❓چجوری سنجد جمع کنم❓"],
                        ]
                    ),
                    "text" => "به سِنجد خوش اومدی! 🎉🎊\n\nبرای استفاده از سیستم «سِنجد» و تخفیف‌های اون روی دکمه های زیر کلیک کن 👍🏻\n\nکلی شارژ و تخفیف و هدیه منتظرته 🎁"
                ];
                break;
            case 2:
                return [
                    "keyboard" => $bot->inline_keyboard([
                            [
                                ["text" => "در کانال ها عضو شدم", "callback_data" => "check:joinch"], // ino zad pm e del she pm e start ba function aye start run she ke user am add she db
                            ],
                        ]
                    ),
                    "text" => $extra . " جان عزیز\n\nشما به سنجد دعوت شدی🌱\n\nاینجا میتونی کلی سنجد جمع کنی و اونارو به 📱شارژ، 🚘سفر، 🍕کد تخفیف رستوران و کلی تخفیف جذاب دیگه تبدیل کنی🎉🎊\n\nتیم سنجد برای اینکه بتونه از پس هزینه های سنگینش در بیاد نیاز به حمایت شما عزیزان داره❤️\nاگه میخوای ادامه بدی توی کانال سنجد و پرشین عضو شو و روی دکمه «در کانال ها عضو شدم» کلیک کن\n\nکلی اتفاق‌های هیجان انگیز منتظرته☺️\n\nآیدی کانال ها:\n\n🌿 @SubCreator\n\n🅱️ @SubCreator"
                ];
                break;
            case 3:
                return [
                    "keyboard" => $bot->keyboard([
                            ["⏳ عضویت در کانال سنجد (5 سنجد)"],
                            ["✅ دعوت کاربران به ربات (3 سنجد)"],
                            ["برگشت🔙"],
                        ]
                    ),
                    "text" => "برای جمع کردن سنجد میتونی از دکمه های زیر استفاده کنی"
                ];
                break;
            case 4:
                $points = $bot->getPoints();
                return [
                    "text" => "شما " . $points[1] . " سنجد تایید شده \nو " . $points[0] . " سنجد تایید نشده دارید\n\n✅ سنجدهای تایید شده: مربوط به کابرانی هستند که با لینک شما وارد شده‌اند و حساب کاربری خودشون رو تایید کردند\n\n⚠️ سنجدهای تایید نشده: مربوط به آن دسته از زیر مجموعه‌های شما هستند که هنوز حساب کاربری خودشان را تایید نکرده اند."
                ];
                break;
            case 5:
                return [
                    "keyboard" => $bot->keyboard([
                            ["⏳ تبدیل سنجد به شارژ"],
                            ["⏳ تبدیل سنجد به کدتخفیف"],
                            ["⏳ تبدیل سنجد به پول نقد"],
                            ["برگشت🔙"],
                        ]
                    ),
                    "text" => "اگه میخوای سنجداتو تبدیل به شارژ یا کدتخفیف کنی روی دکمه مورد نظر کلیک کن"
                ];
                break;
            case 6:
                return [
                    "keyboard" => $this->get($extra)["keyboard"],
                    "text" => "قبلا تو کانالمون عضو شدی و سنجدتو گرفتی🌿"
                ];
                break;
            case 7:
                return [
                    "keyboard" => $this->get($extra)["keyboard"],
                    "text" => "عضویت شما با موفقیت در کانال ما تایید شد و 5 امتیاز دریافت کردید✅"
                ];
                break;
            case 8:
                return [
                    "keyboard" => $bot->keyboard([
                            ["📲ایرانسل", "📲همراه اول", "📲رایتل"],
                            ["برگشت🔙", "منو اصلی⏪"],
                        ]
                    ),
                    "text" => "لطفا اپراتور خود را انتخاب نمایید 👇"
                ];
                break;
            case 9:
                return [
                    "keyboard" => $bot->keyboard([
                            ["💼 کارت تخفیف دیجیکالا"],
                            ["🍕 کارت تخفیف اسنپ فود", "🚕 کارت تخفیف اسنپ"],
                            ["برگشت🔙", "منو اصلی⏪"],
                        ]
                    ),
                    "text" => "لطفا یکی از گزینه های زیر را انتخاب نمایید 👇"
                ];
                break;
            case 10:
                return [
                    "keyboard" => $bot->keyboard([
                            ["100 هزار تومان (1400 سنجد)"],
                            ["200 هزار تومان (2700 سنجد)"],
                            ["500 هزار تومان (6700 سنجد)"],
                            ["برگشت🔙", "منو اصلی⏪"],
                        ]
                    ),
                    "text" => "لطفا یکی از گزینه های زیر را انتخاب نمایید 👇"
                ];
                break;
            case 11:
                return [
                    "text" => "در حال آماده سازی بنر شما..."
                ];
                break;
            case 12:
                return [
                    "keyboard" => $this->get(3)["keyboard"],
                    "text" => "(متن رو خودتون تکمیل کنید)\n----------------------\nلینک شما:\nhttps://t.me/" . $bot->username . "?start=" . $extra
                ];
                break;
            case 13:
                $extra = $this->get($extra);
                return [
                    "keyboard" => $extra["keyboard"],
                    "text" => "خطا: لینک زیر مجموعه گیری نامعتبر است...\n➖➖➖➖➖➖➖➖➖➖\n" . $extra["text"]
                ];
                break;
            case 14:
                $extra = $this->get($extra);
                return [
                    "keyboard" => $extra["keyboard"],
                    "text" => "خطا: شما نمیتوانید روی لینک خودتان کلیک کنید...\n➖➖➖➖➖➖➖➖➖➖\n" . $extra["text"]
                ];
                break;
            case 15:
                $extra = $this->get($extra);
                return [
                    "keyboard" => $extra["keyboard"],
                    "text" => "خطا: شما از قبل در این ربات عضو بوده اید و دیگر نمیتوانید با استفاده از لینک های زیر مجموعه گیری وارد ربات شوید...\n➖➖➖➖➖➖➖➖➖➖\n" . $extra["text"]
                ];
                break;
            case 16:
                return [
                    "keyboard" => $bot->keyboard(
                        [
                            [
                                ['text' => 'ارسال شماره📱', 'request_contact' => true],
                            ],
                        ]
                    ),
                    "text" => "به سِنجد خوش اومدی! 🎉🎊\n\nاینجا میتونی کلی سنجد جمع کنی و اونارو به 📱شارژ، 🚘سفر، 🍕کد تخفیف رستوران و کلی تخفیف جذاب دیگه تبدیل کنی🎉🎊\n➖➖➖➖➖➖➖➖\nفقط یک مرحله دیگه مونده تا تو هم سنجدی شی😃\nروی دکمه زیر کلیک کن و شماره موبایلت رو با ما به اشتراک بگذار؛\nبرای این کار روی دکمه مربع ‌شکل 🎛 پایین کلیک و بعد گزینه «ارسال شماره📱»  رو انتخاب کن تا دکمه های ربات برای تو نمایش داده بشه. 👍🏻"
                ];
                break;
            case 17:
                return [
                    "keyboard" => $this->get(16)["keyboard"],
                    "text" => "شماره شما مربوط به ایران نیست و نمیتوانید به این ربات دسترسی داشته باشید..."
                ];
                break;
            case 18:
                return [
                    "keyboard" => $this->get(16)["keyboard"],
                    "text" => "خطایی رخ داده است⚠️\nاین شماره مربوط به حساب کاربری شما نیست!\nلطفا با از استفاده از دکمه زیر شمارتون را ارسال کنید:"
                ];
                break;
            case 19:
                return [
                    "keyboard" => $this->get(16)["keyboard"],
                    "text" => "فقط یک مرحله دیگه مونده تا تو هم سنجدی شی😃\nروی دکمه زیر کلیک کن و شماره موبایلت رو با ما به اشتراک بگذار؛\nبرای این کار روی دکمه مربع ‌شکل 🎛 پایین کلیک و بعد گزینه «ارسال شماره📱»  رو انتخاب کن تا دکمه های ربات برای تو نمایش داده بشه. 👍🏻"
                ];
                break;
            case 20:
                $extra = $this->get(1);
                return [
                    "keyboard" => $extra["keyboard"],
                    "text" => "اکانت شما با موفقیت تایید شد✅\n➖➖➖➖➖➖➖➖➖➖\n" . $extra["text"]
                ];
                break;
            case 21:
                return [
                    "keyboard" => $bot->keyboard([
                            ["آمار ربات", "افزودن اعتبار"],
                            ["برگشت🔙"],
                        ]
                    ),
                    "text" => "به پنل مدیریتی ربات خوشامدید..."
                ];
                break;
            case 404:
                return [
                    "keyboard" => $this->get($extra)["keyboard"],
                    "text" => "دستور وارد شده اشتباه است⚠️"
                ];
                break;
            case 422:
                return [
                    "keyboard" => $this->get($extra)["keyboard"],
                    "text" => "مرحله غیر قابل پردازش شناسایی و حذف شد⚠️\nمرحله:" . $extra
                ];
                break;
            default:
                return "Error 404T";
                break;
        }
    }
}